iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХНазначениеСтатусов/УБХНазначениеСтатусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБХНазначениеСтатусов</name>
  <tabularSections>
    <name>ИдентификаторыОбъектов</name>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/УБХНазначениеСтатусовОбъектамМетаданных/УБХНазначениеСтатусовОбъектамМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБХНазначениеСтатусовОбъектамМетаданных</name>
  <dimensions>
    <name>НазначениеСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХНазначениеСтатусов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УБХНазначениеСтатусовОбъектамМетаданных");
	ЭлементБлокировки.УстановитьЗначение("НазначениеСтатуса", Ссылка);

	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
 
	НаборЗаписей = РегистрыСведений.УБХНазначениеСтатусовОбъектамМетаданных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НазначениеСтатуса.Установить(Ссылка);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаТЧ Из ИдентификаторыОбъектов Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.НазначениеСтатуса 		= Ссылка;
		ЗаписьНабора.ИдентификаторОбъекта 	= СтрокаТЧ.ИдентификаторОбъекта;
	КонецЦикла;
		
	НаборЗаписей.Записать();

КонецПроцедуры
	
#КонецЕсли
